# D110:3つの数字
# 制限時間カウント
# タイムアップ！
# 3 つの整数がスペース区切りで与えられます。
# 3 つの整数を掛け算した数値を出力して下さい。

# 例えば入力例 1 では

# 4 10 5
# この場合 4 × 10 × 5 で

# 200
# と出力して下さい。

# 評価ポイント
# 10回のテストケースで、正答率、実行速度、メモリ消費量をはかり得点が決まります。
# より早い回答時間で提出したほうが得点が高くなります。
# 複数のテストケースで正しい出力がされるか評価（+50点）
# 解答までの速さ評価（+50点）
# 入力される値
# 入力は以下のフォーマットで与えられます。

# a b c
# ・3 つの整数 a, b, c が与えられます。
# ・末尾に改行が 1 つ入ります。


# それぞれの値は文字列で標準入力から渡されます。標準入力からの値取得方法はこちらをご確認ください
# 期待する出力
# 3 つの整数を掛け算した数値を出力して下さい。

# 末尾に改行を入れ、余計な文字、空行を含んではいけません。

# 条件
# すべてのテストケースにおいて、以下の条件をみたします。

# ・0 ≦ a, b, c ≦ 100
# 入力例1
# 4 10 5
# 出力例1
# 200
# 入力例2
# 0 2 3
# 出力例2
# 0
#a=0
#b=2
#c=3
a, b, c = gets.chomp.split.map(&:to_i)

result = a * b * c

puts result
