# D194:カロリーの計算
# あなたは食事のカロリーの計算をしています。
# 主食のお米のカロリーを計算することにしました。

# 1 合あたり 540 kcalとして1日に食べるお米の量 n 合が与えられるので何 kcal摂取するのかを出力してください。

# 入力例 1 の場合
# 2
# と入力されるので
# 1080
# と出力してください。
# 評価ポイント
# 10回のテストケースで、正答率、実行速度、メモリ消費量をはかり得点が決まります。
# より早い回答時間で提出したほうが得点が高くなります。
# 複数のテストケースで正しい出力がされるか評価（+50点）
# 解答までの速さ評価（+50点）
# 入力される値
# 入力は以下のフォーマットで与えられます。

# n
# ・1日に食べるお米の量 n 合が入力されます。
# ・入力は合計で 1 行となり、入力値最終行の末尾に改行が 1 つ入ります。


# それぞれの値は文字列で標準入力から渡されます。標準入力からの値取得方法はこちらをご確認ください
# 期待する出力
# 1 合あたり 540 kcalとして1日に食べるお米の量 n 合が与えられるので何 kcal摂取するのかを出力してください。

# 末尾に改行を入れ、余計な文字、空行を含んではいけません。

# 条件
# すべてのテストケースにおいて、以下の条件をみたします。

# ・1 ≦ n ≦ 10
# 入力例1
# 2
# 出力例1
# 1080
# 入力例2
# 5
# 出力例2
# 2700n 
n =5 #gets.chomp.to_i
if 1 <= n && n<= 10
 total=n*540
 puts total
else    
 puts "false"
end