# D253:宝くじとかけ金
# A 君はとある宝くじを買うことにしました、その宝くじでは当選した場合、かけ金の 2 乗の金額が返金されます。
# A 君のかけ金 N 円が与えられるので、A 君が当選した場合に返金される金額を求めるプログラムを作成してください。

# 入力例 1 の場合
# 180
# A 君のかけ金が 180 円で、その 2 乗の金額が返金されるので
# 32400
# と出力してください。
# 評価ポイント
# 10回のテストケースで、正答率、実行速度、メモリ消費量をはかり得点が決まります。
# より早い回答時間で提出したほうが得点が高くなります。
# 複数のテストケースで正しい出力がされるか評価（+50点）
# 解答までの速さ評価（+50点）
# 入力される値
# 入力は以下のフォーマットで与えられます。

# N
# ・1 行目に A 君のかけ金 N 円が与えられます。
# ・入力は合計で 1 行となり、入力値最終行の末尾に改行が 1 つ入ります。


# それぞれの値は文字列で標準入力から渡されます。標準入力からの値取得方法はこちらをご確認ください
# 期待する出力
# A 君が宝くじに当選した場合に、返金される金額を出力してください。
# 出力最終行の末尾に改行を入れ、余計な文字、空行を含んではいけません。

# 条件
# すべてのテストケースにおいて、以下の条件をみたします。

# ・0 ≦ N ≦ 300
# 入力例1
# 180
# 出力例1
# 32400
# 入力例2
# 300
# 出力例2
# 90000
N= gets.chomp.to_i
if 0 <= N && N <= 300
    total=N*N
    puts total
else
    puts"false"
end