# 再チャレンジ D210:年間の料金
# あなたはあるサービスに月額料金を払っています。


#年間でいくらになるか気になったので計算することにしました。

# 月額 p 円の料金の時、 12 ヶ月でいくら払うことになるか出力してください。
#p*12=年間金額
# 入力例 1 の場合
# 980
# 980 × 12 となるので
# 11760
# と出力してください。
# 評価ポイント
# 10回のテストケースで、正答率、実行速度、メモリ消費量をはかり得点が決まります。
# より早い回答時間で提出したほうが得点が高くなります。
# 複数のテストケースで正しい出力がされるか評価（+50点）
# 解答までの速さ評価（+50点）
# 入力される値
# 入力は以下のフォーマットで与えられます。

# p
# ・1 行目に月額の料金 p 円が与えられます。
# ・入力は合計で 1 行となり、入力値最終行の末尾に改行が 1 つ入ります。


# それぞれの値は文字列で標準入力から渡されます。標準入力からの値取得方法はこちらをご確認ください
# 期待する出力
# 月額 p 円の料金の時、 12 ヶ月でいくら払うことになるか出力してください。

# 出力最終行の末尾に改行を入れ、余計な文字、空行を含んではいけません。

# 条件
# すべてのテストケースにおいて、以下の条件をみたします。

# ・100 ≦ p ≦ 10,000
# 入力例1
# 980
# 出力例1
# 11760
# 入力例2
# 100
# 出力例2
# 1200

p =gets.chomp.to_i
if p >= 100 && p <= 10000
    fullpay=  p*12
    puts fullpay
else
    "月額 p 円の料金の予算オーバ"
end