# 異能コラボ問題】D242:所持金の合計
# A 君の所持金は a 円です。また B 君の所持金は b 円です。A 君と B 君の合計の所持金は何円ですか？

# 入力例 1 の場合
# 180
# 150
# A 君の所持金の 180 円と B 君の所持金の 150 円を合計して 330 円なので
# 330
# と出力してください。
# 評価ポイント
# 10回のテストケースで、正答率、実行速度、メモリ消費量をはかり得点が決まります。
# より早い回答時間で提出したほうが得点が高くなります。
# 複数のテストケースで正しい出力がされるか評価（+50点）
# 解答までの速さ評価（+50点）
# 入力される値
# 入力は以下のフォーマットで与えられます。

# a
# b
# ・1 行目に A 君の所持金 a が与えられます。
# ・2 行目に B 君の所持金 b が与えられます。


# それぞれの値は文字列で標準入力から渡されます。標準入力からの値取得方法はこちらをご確認ください
# 期待する出力
# A 君の所持金と B 君の所持金の合計金額を出力してください。
# 出力最終行の末尾に改行を入れ、余計な文字、空行を含んではいけません。

# 条件
# すべてのテストケースにおいて、以下の条件をみたします。

# ・0 ≦ a ≦ 500
# ・0 ≦ b ≦ 500
# 入力例1
# 180
# 150
# 出力例1
# 330
# 入力例2
# 300
# 11
# 出力例2
# 311
a=300
b=11
if (0 <= a&&a <= 500) && (0 <= b&&b <= 500)
total = a+b
puts total
else
puts "false"
end

A= gets.chomp.to_i
B= gets.chomp.to_i

if (1 <= A && A <= 500) && (1 <= B && B <= 500) && (A != B)
    if A-B < 0
      puts "Yes"
    else
      puts "No"
    end
else
   puts"fauls"
end