# D249:株取引の損益
# A 君は株取引をしています。A 君は B 社の株を X 円で購入しましたが、1 年後に Y 円で売却しました。
# A 君がこの取引で得した場合は Yes を、損した場合は No　を出力してください。

# 入力例 1 の場合
# 210
# 190
# A 君は株を 210 円で買い、190 円で売却しているので損をしています。
#  No 
# と出力してください。
# 評価ポイント
# 10回のテストケースで、正答率、実行速度、メモリ消費量をはかり得点が決まります。
# より早い回答時間で提出したほうが得点が高くなります。
# 複数のテストケースで正しい出力がされるか評価（+50点）
# 解答までの速さ評価（+50点）
# 入力される値
# 入力は以下のフォーマットで与えられます。

# A
# B
# ・1 行目に A 君の株の購入価格が与えられます。
# ・2 行目に A 君の株の売却価格が与えられます。
# ・入力は 2 行となり、末尾に改行が 1 つ入ります。


# それぞれの値は文字列で標準入力から渡されます。標準入力からの値取得方法はこちらをご確認ください
# 期待する出力
# A 君株取引で損したか得したかを出力してください。
# 出力最終行の末尾に改行を入れ、余計な文字、空行を含んではいけません。

# 条件
# すべてのテストケースにおいて、以下の条件をみたします。

# ・1 ≦ A ≦ 500
# ・1 ≦ B ≦ 500
# ・A ≠ B
# 入力例1
# 210
# 190
# 出力例1
# No
# 入力例2
# 30
# 110
# 出力例2
# Yes
A= gets.chomp.to_i
B= gets.chomp.to_i

if (1 <= A && A <= 500) && (1 <= B && B <= 500) && (A != B)
    if A-B < 0
      puts "Yes"
    else
      puts "No"
    end
else
   puts"fauls"
end