#D185:時給の計算
# あなたは給与の計算プログラムを作成しています。
# 時給 N と働いた時間 M が改行区切りで与えられるので給与を出力してください。

# 入力例 1 の場合
# 1120
# 6
# と入力されるので
# 6720
# と出力してください。
# 評価ポイント
# D185:時給の計算
# 10回のテストケースで、正答率、実行速度、メモリ消費量をはかり得点が決まります。
# より早い回答時間で提出したほうが得点が高くなります。
# 複数のテストケースで正しい出力がされるか評価（+50点）
# 解答までの速さ評価（+50点）
# 入力される値
# 入力は以下のフォーマットで与えられます。

# N
# M
# ・1行目には時給 N 入力されます。
# ・2行目には働いた時間 M が入力されます。
# ・入力は合計で 2 行となり、入力値最終行の末尾に改行が 1 つ入ります。


# それぞれの値は文字列で標準入力から渡されます。標準入力からの値取得方法はこちらをご確認ください
# 期待する出力
# 時給 N と働いた時間 M が改行区切りで与えられるので給与を出力してください。

# 末尾に改行を入れ、余計な文字、空行を含んではいけません。

# 条件
# すべてのテストケースにおいて、以下の条件をみたします。

# ・1100 ≦ N ≦ 5000
# ・1 ≦ M ≦ 200
# ・N, M は整数
# 入力例1
# 1120
# 6
# 出力例1
# 6720
# 入力例2
# 2550
# 120
# 出力例2
# 306000
N =  gets.chomp.to_i
M =  gets.chomp.to_i

if N >= 1100 && N <= 5000 && M >= 1 && M <= 200
  total_pay = N * M
  puts total_pay
else
  puts "入力された値が範囲外です。時給は1100から5000の間で、働いた時間は1から200の間で入力してください。"
end
