# D077:計算機の表示
# あなたは正の整数の掛け算のみをする計算機のプログラムを作成しています。
# その計算機は最大で4桁までしか表示できず 9,999 より大きな数字は表示が出来ず "NG" と表示されます。

# 2つの正の整数 a, b が入力されるので、a と bを掛け算した時 9,999 以下であれば掛け算した結果を出力し、10,000 以上の場合は "NG" と出力するプログラムを作成してください。

# 評価ポイント
# 10回のテストケースで、正答率、実行速度、メモリ消費量をはかり得点が決まります。
# より早い回答時間で提出したほうが得点が高くなります。
# 複数のテストケースで正しい出力がされるか評価（+50点）
# 解答までの速さ評価（+50点）
# 入力される値
# 入力は以下のフォーマットで与えられます。

# a b
# 入力は 1 行となり末尾に改行が入ります。


# それぞれの値は文字列で標準入力から渡されます。標準入力からの値取得方法はこちらをご確認ください
# 期待する出力
# 2つの正の整数 a, b が入力されるので、a と bを掛け算した時 9,999 以下であれば掛け算した結果を出力し、10,000 以上の場合は "NG" と出力してください。

# 出力最後に改行を 1 つ入れ、余計な文字、空行を含んではいけません。

# 条件
# すべてのテストケースにおいて、以下の条件をみたします。

# ・a, b はそれぞれ整数
# ・1 ≦ a, b ≦ 9,999
# 入力例1
# 100 20
# 出力例1
# 2000
# 入力例2
# 9999 29
# 出力例2
# NG
#a=9999 
#b=29
a, b = gets.chomp.split.map(&:to_i)

result = a * b

if result <= 9999
  puts result
else
  puts "NG"
end
